CREATION OF DATAFRAMES IN PANDAS

In [1]:
import pandas as pd

data = {"Name":["John","Peter","Lisa"],
        "Age" : [25,28,31],
        "Salary":[300000,45000,25000]}
df = pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   John   25  300000
1  Peter   28   45000
2   Lisa   31   25000

In [6]:
data = pd.read_excel("IBM-313 Marks.xlsx")
print(data)

    S.No.  MTE (25)  Mini Project (25)  Total (50)  ETE (50)  Total
0       1      5.00                 20       25.00      12.0  37.00
1       2     11.05                 20       31.05      26.0  57.05
2       3      8.10                 20       28.10      14.0  42.10
3       4      6.00                 10       16.00      13.0  29.00
4       5     11.35                 20       31.35      17.0  48.35
..    ...       ...                ...         ...       ...    ...
74     75     12.05                 10       22.05      20.0  42.05
75     76     12.25                 10       22.25      28.0  50.25
76     77      1.75                 10       11.75       NaN   0.00
77     78      3.00                 10       13.00       NaN   0.00
78     79      5.80                 10       15.80      12.0  27.80

[79 rows x 6 columns]

EXPLORING DATA IN PANDAS

In [11]:
import pandas as pd
data = pd.read_excel("ESD.xlsx")
print(data.head())
print(data.tail())

     EEID        Full Name                 Job Title Department  \
0  E02387      Emily Davis                Sr. Manger         IT
1  E04105    Theodore Dinh       Technical Architect         IT
2  E02572     Luna Sanders                  Director    Finance
3  E02832  Penelope Jordan  Computer Systems Manager         IT
4  E01639        Austin Vo               Sr. Analyst    Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
       EEID     Full Name       Job Title  Department        Business Unit  \
995  E03094  Wesley Young     Sr. Analyst   Marketing  Speciality Products
996  E01909  Lillian Khan         Analyst     Finance  Speciality Products
997  E04398   Oliver Yang        Director   Marketing  Speciality Products
998  E02521   Lily Nguyen     Sr. Analyst     Finance  Speciality Products
999  E03545   Sofia Cheng  Vice President  Accounting            Corporate

     Gender  Ethnicity  Age  Hire Date  Annual Salary  Bonus %        Country  \
995    Male  Caucasian   33 2016-09-18          98427     0.00  United States
996  Female      Asian   44 2010-05-31          47387     0.00          China
997    Male      Asian   31 2019-06-10         176710     0.15  United States
998  Female      Asian   33 2012-01-28          95960     0.00          China
999  Female      Asian   63 2020-07-26         216195     0.31  United States

         City  Exit Date
995  Columbus        NaT
996   Chengdu 2018-01-08
997     Miami        NaT
998   Chengdu        NaT
999     Miami        NaT

In [12]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [14]:
print(data.describe())

               Age                   Hire Date  Annual Salary      Bonus %  \
count  1000.000000                        1000    1000.000000  1000.000000
mean     44.382000  2012-04-07 02:54:14.400000  113217.365000     0.088660
min      25.000000         1992-01-09 00:00:00   40063.000000     0.000000
25%      35.000000         2007-02-14 00:00:00   71430.250000     0.000000
50%      45.000000         2014-02-15 12:00:00   96557.000000     0.000000
75%      54.000000         2018-06-22 00:00:00  150782.250000     0.150000
max      65.000000         2021-12-26 00:00:00  258498.000000     0.400000
std      11.246981                         NaN   53545.985644     0.117856

                           Exit Date
count                             85
mean   2016-11-02 18:04:14.117647104
min              1994-12-18 00:00:00
25%              2014-12-25 00:00:00
50%              2019-05-23 00:00:00
75%              2021-04-09 00:00:00
max              2022-08-17 00:00:00
std                              NaN

In [15]:
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

HANDLING DUPLICATES

In [15]:
import pandas as pd
import numpy as np
df = pd.read_csv("company1.csv")
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [5]:
print(df["EEID"].duplicated().sum())

2

In [7]:
print(df.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

WORKING WITH MISSING DATA OR NULL VALUES IN PANDAS

In [8]:
import pandas as pd
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [ ]:
# Find null values
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [ ]:
#Drop null values
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [12]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [17]:
print(data["salary"].mean())

24400.0

In [ ]:
# Replace Null values
data["salary"] = data["salary"].replace(np.nan,24400)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [19]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [ ]:
# Forward Fill 
print(data.fillna(method = "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\MOHD SAQIB KHAN\AppData\Local\Temp\ipykernel_16128\3398275669.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [ ]:
# Backward Fill
print(data.fillna(method = "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\MOHD SAQIB KHAN\AppData\Local\Temp\ipykernel_16128\2754045057.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

COLUMNS TRANSFORMATION IN PANDAS - PART1

In [26]:
print(data.head())

     EEID        Full Name                 Job Title Department  \
0  E02387      Emily Davis                Sr. Manger         IT
1  E04105    Theodore Dinh       Technical Architect         IT
2  E02572     Luna Sanders                  Director    Finance
3  E02832  Penelope Jordan  Computer Systems Manager         IT
4  E01639        Austin Vo               Sr. Analyst    Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT

In [1]:
import pandas as pd

df = pd.read_excel("ESD.xlsx")

# Fixing the column assignment and naming issue
df.loc[df["Bonus %"] == 0, "GetsBonus"] = "no bonus"
df.loc[df["Bonus %"] > 0, "GetsBonus"] = "bonus"

# Correct variable name in print statement
print(df.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date GetsBonus
0     0.15  United States    Seattle 2021-10-16     bonus
1     0.00          China  Chongqing        NaT  no bonus
2     0.20  United States    Chicago        NaT     bonus
3     0.07  United States    Chicago        NaT     bonus
4     0.00  United States    Phoenix        NaT  no bonus
5     0.00          China  Chongqing        NaT  no bonus
6     0.10  United States    Phoenix        NaT     bonus
7     0.00  United States      Miami 2021-05-20  no bonus
8     0.06  United States     Austin        NaT     bonus
9     0.00  United States    Chicago        NaT  no bonus

In [8]:
import pandas as pd

df = {
    "First_name": ["ross", "rachel", "monica", "joey", "chandler", "phoebe"],
    "last_name": ["tribbiani", "bing", "green", "geller", "buffay", "bing"],
    "Salary": [20000, 40000, 25000, 60000, 33000, 45000]
}

# Corrected the column name from 'last name' to 'last_name'
df["Full Name"] = pd.Series(df["First_name"]).str.capitalize() + " " + pd.Series(df["last_name"]).str.capitalize()

data = pd.DataFrame(df)
print(data)

  First_name  last_name  Salary        Full Name
0       ross  tribbiani   20000   Ross Tribbiani
1     rachel       bing   40000      Rachel Bing
2     monica      green   25000     Monica Green
3       joey     geller   60000      Joey Geller
4   chandler     buffay   33000  Chandler Buffay
5     phoebe       bing   45000      Phoebe Bing

Columns Transformation in pandas - part 2

In [ ]:
import pandas as pd

data = pd.read_csv("company1.csv")
#print(data)

data["Bonus"] = data["salary"]/100*20
print(data)

    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F      NaN     NaN
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali    NaN  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05       NaN      M  25000.0  5000.0
5  EMP06     rohit      M      NaN     NaN
6  EMP02     rohit      M  25000.0  5000.0
    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F      NaN     NaN
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali    NaN  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05       NaN      M  25000.0  5000.0
5  EMP06     rohit      M      NaN     NaN
6  EMP02     rohit      M  25000.0  5000.0

In [20]:
data = {"Months" : ["january","February","March","April"]}
a = pd.DataFrame(data)
print(a)

def extract(value):
    return value[0:3]
a["short_months"] = a["Months"].map(extract)
print(a)

     Months
0   january
1  February
2     March
3     April
     Months short_months
0   january          jan
1  February          Feb
2     March          Mar
3     April          Apr

GROUP BY IN PANDAS

In [21]:
import pandas as pd
data = pd.read_excel("ESD.xlsx")
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [24]:
gp = data.groupby(["Department","Gender"]).agg({"Gender":"count"})
print(gp)

                        Gender
Department      Gender
Accounting      Female      53
                Male        43
Engineering     Female      80
                Male        78
Finance         Female      69
                Male        51
Human Resources Female      64
                Male        61
IT              Female     119
                Male       122
Marketing       Female      57
                Male        63
Sales           Female      76
                Male        64

In [34]:
gp1 = data.groupby(["Country","Gender"]).agg({"Annual Salary":"mean","Age"
                                   :"min"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female  111343.733333   25
              Male    113474.562500   26
China         Female  113904.908257   25
              Male    113742.155963   25
United States Female  112012.964072   25
              Male    114493.051780   25

MERGE , JOIN AND CONCATENATE IN PANDAS

In [23]:
import pandas as pd
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
         "Names":["Ram","Shyam","Vishal","Ravi","John","saqib"],
         "Age" : [34,56,23,44,32,45]}

data2 = {"Emp Id":["E01","E07","E03","E04","E08","E06"],
          "salary":[45000,56000,34000,30000,50000,55000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03  Vishal   23
3    E04    Ravi   44
4    E05    John   32
5    E06   saqib   45

  Emp Id  salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   55000

In [10]:
print(pd.merge(left = df1,right = df2,on = "Emp Id"))

  Emp Id   Names  Age  salary
0    E01     Ram   34   45000
1    E03  Vishal   23   34000
2    E04    Ravi   44   30000
3    E06   saqib   45   55000

In [11]:
print(pd.merge(left = df1,right = df2,on = "Emp Id",how = "left"))

  Emp Id   Names  Age   salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03  Vishal   23  34000.0
3    E04    Ravi   44  30000.0
4    E05    John   32      NaN
5    E06   saqib   45  55000.0

In [12]:
print(pd.merge(left = df1,right = df2,on = "Emp Id",how = "right"))

  Emp Id   Names   Age  salary
0    E01     Ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03  Vishal  23.0   34000
3    E04    Ravi  44.0   30000
4    E08     NaN   NaN   50000
5    E06   saqib  45.0   55000

In [27]:
import pandas as pd
data1 = {"Emp Id":["E01","E02","E03","E04","E05","E06"],
         "Names":["Ram","Shyam","Vishal","Ravi","John","saqib"],
         "Age" : [34,56,23,44,32,45]}

data2 = {"Emp Id":["E07","E08","E09","E10","E11","E12"],
         "Names" : ["bittu","chintu","pappu","chotu","bunty","golu"],
          "Age" : [34,56,23,44,32,45]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [28]:
print(pd.concat([df1,df2]))

  Emp Id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03  Vishal   23
3    E04    Ravi   44
4    E05    John   32
5    E06   saqib   45
0    E07   bittu   34
1    E08  chintu   56
2    E09   pappu   23
3    E10   chotu   44
4    E11   bunty   32
5    E12    golu   45

COMPARE DATAFRAMES PANDAS - Part 1

In [37]:
import pandas as pd
dict = {"Fruits":["mango","apples","banana","papaya"],
        "Price" : [100,150,50,35],
        "Quantity":[15,10,10,3]
        }
df = pd.DataFrame(dict)
print(df)

df2 = df.copy()

df2.loc[0,"Price"] = 120
df2.loc[1,"Price"] = 175
df2.loc[2,"Price"] = 30
df2.loc[0,"Quantity"]=12
df2.loc[1,"Quantity"]=15
df2.loc[2,"Quantity"]=5
print(df2)

   Fruits  Price  Quantity
0   mango    100        15
1  apples    150        10
2  banana     50        10
3  papaya     35         3
   Fruits  Price  Quantity
0   mango    120        12
1  apples    175        15
2  banana     30         5
3  papaya     35         3

In [46]:
#Compare function
print(df.compare(df2))

print(df.compare(df2,align_axis=0))

print(df.compare(df2,keep_equal = True))

print(df.compare(df2,keep_equal = False))

print(df.compare(df2,keep_shape = True))

print(df.compare(df2,keep_shape = False))

   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
2   50.0   30.0     10.0   5.0
         Price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
2 self    50.0      10.0
  other   30.0       5.0
  Price       Quantity
   self other     self other
0   100   120       15    12
1   150   175       10    15
2    50    30       10     5
   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
2   50.0   30.0     10.0   5.0
  Fruits        Price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0     15.0  12.0
1    NaN   NaN  150.0  175.0     10.0  15.0
2    NaN   NaN   50.0   30.0     10.0   5.0
3    NaN   NaN    NaN    NaN      NaN   NaN
   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
2   50.0   30.0     10.0   5.0

COMPARE DATAFRAMES PANDAS - Pivoting and Melting of DataFrame

In [ ]:
# Pivoting
import pandas as pd

data = {
    "Keys": ["k1", "k2", "k1", "k2"],
    "Names": ["John", "Ben", "David", "Peter"],
    "Houses": ["red", "blue", "green", "red"],
    "Grades": ["3rd","8th","9th","8th"]
}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)


pivot_result = df.pivot(index="Keys", columns="Names", values=["Houses","Grades"])
print("\nPivot Table:\n", pivot_result)

Original DataFrame:
   Keys  Names Houses Grades
0   k1   John    red    3rd
1   k2    Ben   blue    8th
2   k1  David  green    9th
3   k2  Peter    red    8th

Pivot Table:
       Houses                   Grades
Names    Ben  David John Peter    Ben David John Peter
Keys
k1       NaN  green  red   NaN    NaN   9th  3rd   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

In [58]:
# Melting
import pandas as pd

dict = {
    "Names": ["John", "Ben", "David", "Peter"],
    "Houses": ["red", "blue", "green", "red"],
    "Grades": ["3rd","8th","9th","8th"]
}
df = pd.DataFrame(dict)
print(df)

melt_Data = pd.melt(df,id_vars=["Names"],value_vars = ["Houses","Grades"],var_name = "Houses&Grades",value_name = "values")
print(melt_Data)

   Names Houses Grades
0   John    red    3rd
1    Ben   blue    8th
2  David  green    9th
3  Peter    red    8th
   Names Houses&Grades values
0   John        Houses    red
1    Ben        Houses   blue
2  David        Houses  green
3  Peter        Houses    red
4   John        Grades    3rd
5    Ben        Grades    8th
6  David        Grades    9th
7  Peter        Grades    8th